In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\federico.bergada\application data\lib\site-packages (2.0.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\federico.bergada\application data\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\federico.bergada\application data\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\federico.bergada\application data\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\federico.bergada\application data\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\federico.bergada\application data\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import pandas as pd

In [3]:
pd.__version__

'2.0.1'

In [7]:
# CREAR UNA SERIE
clases = pd.Series(["Matemáticas","Lengua","Ciencias Naturales"])
notas_promedio = pd.Series([6,8,7])

# CREAR UN DATAFRAME
df = pd.DataFrame({"Clases" : clases , "Notas Promedio" : notas_promedio})

In [8]:
df

               Clases  Notas Promedio
0         Matemáticas               6
1              Lengua               8
2  Ciencias Naturales               7

In [12]:
#Lee un archivo csv
pd.read_csv("data.csv")

      codigo_suministro  operacion_apertura Horas Inter       ENS $  Mes
0             350211502           106824133       14,42  2400502,93    4
1             351043001           106678586        5,67  1579801,78    4
2             322456704           104716206      316,71  1474381,23    4
3             361473801           106031574       92,27  1064167,99    4
4             351206501           105303256        2,15   389040,88    4
...                 ...                 ...         ...         ...  ...
2790          361844102           106836993       18,98        0,00    4
2791          362706701           106400914        8,19        0,00    4
2792          367712701           105470058        2,39        0,00    4
2793          367725201           105656626       14,03        0,00    4
2794          367732301           104845506        6,57        0,00    4

[2795 rows x 5 columns]